#Область ОбработчикиСобытий
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость ();
КонецПроцедуры

&НаКлиенте
Процедура ТипКонтрагентаПриИзменении(Элемент)
    УстановитьВидимость ();
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура УстановитьВидимость ()
	Если Объект.ТипКонтрагента = ПредопределенноеЗначение ("Перечисление.ТипыКонтрагентов.Клиент") Тогда
		Элементы.ДатаРожденияКлиента.Видимость = Истина;
		Элементы.Пол.Видимость = Истина;
		Элементы.Источник.Видимость = Истина;
		Элементы.Питомцы.Видимость = Истина; 
		Элементы.ОсновнойДоговор.Видимость = Ложь; 
		Элементы.Наименование.Заголовок = "Ф.И.О. клиента";
	Иначе
		Элементы.ДатаРожденияКлиента.Видимость = Ложь;
		Элементы.Пол.Видимость = Ложь;
		Элементы.Источник.Видимость = Ложь;
		Элементы.Питомцы.Видимость = Ложь;
		Элементы.ОсновнойДоговор.Видимость = Истина;
		Элементы.Наименование.Заголовок = "Наименование";
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

