#Область СлужебныеПроцедурыИФункции
Процедура ПолучитьПодтверждениеРегистрацииКлиентаПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	Для каждого ФормируемаяЗадачи Из ФормируемыеЗадачи Цикл 
		ФормируемаяЗадачи.Наименование = ТочкаМаршрутаБизнесПроцесса.НаименованиеЗадачи + " " + Пользователь.Наименование;
		ФормируемаяЗадачи.ОписаниеЗадачи = "Из мобильного приложения поступила заявка на регистрацию пользователя.
		|Необходимо созвониться с клиентом " + Пользователь.Наименование + " по телефону" + " и получить согласие на регистрацию, а так же дозаполнить карточку клиента - ФИО, Дату рождения , сведения о питомцах и другие данные, которые клиент согласен предоставить.";
	КонецЦикла;
КонецПроцедуры

Процедура ПолучитьПодтверждениеРегистрацииКлиентаПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	Если Задача.ПолученоСогласие Тогда 
		РегистрацияПодтверждена = Истина;
		Записать();
	КонецЕсли;
КонецПроцедуры

Процедура КлиентПодтвердилРегистрациюПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Результат = РегистрацияПодтверждена;  
КонецПроцедуры

Процедура ПометкаНаУдалениеПользователяОбработка(ТочкаМаршрутаБизнесПроцесса)
	СсылкаНаПользователя = Пользователь.Ссылка.ПолучитьОбъект();
	СсылкаНаПользователя.УстановитьПометкуУдаления(Истина);
КонецПроцедуры
#КонецОбласти