#Область ОбработчикиСобытий
&НаКлиенте
Процедура ПризнакБессрочногоДоговораПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
	Если НЕ ЗначениеЗаполнено(Объект.Наименование) Тогда
		СформироватьНаименованиеДоговора();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВнешнийВидДоговораПриИзменении(Элемент)
	СформироватьНаименованиеДоговора();
КонецПроцедуры

&НаКлиенте
Процедура ДатаЗаключенияДоговораПриИзменении(Элемент)
	СформироватьНаименованиеДоговора();
КонецПроцедуры
#КонецОбласти
                          
#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура УстановитьВидимость()
Если Объект.ПризнакБессрочногоДоговора Тогда
    Элементы.СрокОкончанияДоговора.Видимость = Ложь;
	Если ЗначениеЗаполнено(Объект.СрокОкончанияДоговора) Тогда
		Объект.СрокОкончанияДоговора = '0001,01,01';
	КонецЕсли;
Иначе
    Элементы.СрокОкончанияДоговора.Видимость = Истина;
КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СформироватьНаименованиеДоговора()
	Если ЗначениеЗаполнено(Объект.ВнешнийВидДоговора)
		И ЗначениеЗаполнено(Объект.ДатаЗаключенияДоговора) Тогда
		Объект.Наименование = "№ " + Объект.ВнешнийВидДоговора + " от " + Формат(Объект.ДатаЗаключенияДоговора,"ДФ='dd.MM.yyyy ""г.""'"); 	
	ИначеЕсли ЗначениеЗаполнено(Объект.ВнешнийВидДоговора) Тогда  
		Объект.Наименование = "№ " + Объект.ВнешнийВидДоговора;
	Иначе
		Объект.Наименование = " от " + Формат(Объект.ДатаЗаключенияДоговора,"ДФ='dd.MM.yyyy ""г.""'");
	КонецЕсли;
КонецПроцедуры   
#КонецОбласти